app/Http/Controllers/KidController.php

select * from `kids`
select monthname(anniversary) mois, year(anniversary) annee, count(*) tata from `kids` group by `anniversary` order by min(created_at) desc
---
    public function index()
    {
        $kids = Kid::all();
        $req = Kid::selectRaw ("monthname(anniversary) mois, count(*) tata")
                            ->groupBy('anniversary')
                            ->orderByRaw('min(created_at) desc')->get()->toArray();

select `users`.*, `kid_user`.`kid_id` as `pivot_kid_id`, `kid_user`.`user_id` as `pivot_user_id` from `users` inner join `kid_user` on `users`.`id` = `kid_user`.`user_id` where `kid_user`.`kid_id` in ('')
---
    public function create()
    {
        $kid = new Kid();
        $kid->load('users');

insert into `kids` (`firstname`, `lastname`, `anniversary`, `updated_at`, `created_at`) values ('Tristan', 'Palmer', '2004-02-12 22:20:34', '2017-10-03 22:20:34', '2017-10-03 22:20:34')
---
    public function store(Request $request)
    {
        $owner = Auth::user()->id;
        $kids = new Kid();

        $kids->firstname = ucfirst($request->get('firstname'));
        $kids->lastname = ucfirst($request->get('lastname'));
        $kids->anniversary = $request->get('anniversary');
        $kids->save();

select * from `kids` where `kids`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $kid = Kid::findOrFail($id);

select * from `kids` where `kids`.`id` = '1' limit 1
---
    public function update(Request $request, $id)
    {

        $owner = Auth::user()->id;
       $kid = Kid::findOrFail($id);